{
  "successStories": [
    {
      "name": "Joseph Ageng'o",
      "batch": "2024",
      "achievement": "Electrical Engineering • Technical University of Kenya",
      "story": "With consistent mentoring from the Career Guidance Cell, Joseph focused on core STEM subjects, participated in county Olympiads, and developed analytical skills that secured him a top rank.",
      "photo": "/assets/images/career/student1.jpg"
    },
    {
      "name": "Isha Verma",
      "batch": "2025",
      "achievement": "AIIMS Delhi • NEET Rank 42",
      "story": "Through tailored guidance in biology and chemistry, Isha received structured support for competitive exams and gained confidence via mock tests, workshops, and mentorship programs.",
      "photo": "/assets/images/career/student2.jpg"
    },
    {
      "name": "Rohan Malhotra",
      "batch": "2023",
      "achievement": "NLSIU Bangalore • CLAT Rank 12",
      "story": "Rohan honed his legal aptitude, critical thinking, and interview skills under the mentorship of alumni lawyers, ultimately excelling in the national law entrance examination.",
      "photo": "/assets/images/career/student3.jpg"
    },
    {
      "name": "Ananya Singh",
      "batch": "2024",
      "achievement": "University of Oxford • Rhodes Scholar",
      "story": "Ananya's academic excellence and global exposure were nurtured through leadership programs, essay-writing workshops, and college application guidance, leading to a prestigious international scholarship.",
      "photo": "/assets/images/career/student4.jpg"
    },
    {
      "name": "Michael Ochieng",
      "batch": "2023",
      "achievement": "Software Engineering • Google Kenya",
      "story": "Michael's passion for technology was discovered through our career assessment tools. He was guided through programming fundamentals, internships, and portfolio development, leading to his dream job.",
      "photo": "/assets/images/career/student5.jpg"
    },
    {
      "name": "Grace Wanjiku",
      "batch": "2024",
      "achievement": "Medicine • University of Nairobi",
      "story": "Grace received comprehensive guidance on medical school preparation, volunteer work in healthcare settings, and maintained excellent grades with our study support programs.",
      "photo": "/assets/images/career/student6.jpg"
    }
  ]
}